[
  {
    "name": "Scott Davis",
    "description": "A MODS Veteran, in his seventh straight appearance, Scott Davis is the founder of ThirstyHead.com, a training and consulting company that that specializes in leading-edge technology solutions like HTML 5, mobile development, Node.js, SmartTV development, web mapping, NoSQL, Groovy, and Grails. Scott co-founded the HTML5 Denver User Group in 2011.\n\nScott has been writing about web development for over 10 years. His books include Getting Started with Grails, Groovy Recipes, GIS for Web Developers, The Google Maps API: Adding Where to Your Web Applications, and JBoss at Work. Scott is also the author of three popular article series at IBM developerWorks -- Mastering MEAN, Mastering Grails, and Practically Groovy",
    "image": "http://developermarch.com/mds/.img/speaker/ImageBox_MODS_Scott.png",
    "title": "Founder",
    "company": "ThirstyHead.com",
    "website": "http://ThirstyHead.com",
    "blog": "http://ThirstyHead.com",
    "twitter": "",
    "email": "N/A",
    "avatar": "http://developermarch.com/mds/.img/speaker/ImageBox_MODS_Scott.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Steve Scott",
    "description": "Steve Scott (Scotty) has been a freelance developer since 1992 although he is probably best known for being the host on a number of developer podcasts including The iDeveloper Podcast. He was also the host and creator of NSConference. He has been developer since 1987 when he started writing accounting software using COBOL on a Convergent Unix machine using vi as his IDE. (Sorry Emacs people). Since then he has worked on mainframes (ICL, DEC, &s; IBM), 16bit and 32 bit Windows, .NET and since 2007 OS X and (a little later) iOS . During his career he has learnt (and forgotten) more languages and IDEs than is possibly healthy for one lifetime.",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_SteveScott.png",
    "title": "Freelance Developer",
    "company": "",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_SteveScott.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Lohith G N",
    "description": "Lohith has over 15 years of Industry experience. He is a Microsoft MVP for Visual Studio Development & Technologies for 5 years in a row. In his day job he works in the capacity of Technical Evangelist for Progress Software in India. He is part of Bangalore DotNet User group. He is an author and has authored 2 books. You can know more about Lohith here: http://about.me/kashyapa. He is available on twitter as @kashyapa.",
    "image": "http://www.developermarch.com/mds/.img/speaker/Lohith-G-N.png",
    "title": "Developer Advocate",
    "company": "Progress",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/Lohith-G-N.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Mayur Tendulkar",
    "description": "Mayur Tendulkar is Program Manager on Xamarin team at Microsoft India and is a proud Punekar. He proudly calls him MAD - Mobile Application Developer. Before joining Microsoft, he was awarded as Microsoft Most Valuable Professional on Windows Development and worked as Developer Evangelist with Xamarin. He is writing mobile applications since the days of Windows Mobile 5.0 and love to talk about everything mobile. You can find him talking at conferences, user group and working on his hobby apps on Git. His co-ordinates are @mayur_Tendulkar and for git: mayur-tendulkar. You can follow his thoughts on his blog: http://mayurtendulkar.com",
    "image": "http://www.developermarch.com/mds/.img/speaker/Mayur-Tendulkar.png",
    "title": "Program Manager",
    "company": "Xamarin",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/Mayur-Tendulkar.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Nish Anil",
    "description": "Nish is a Senior Program Manager on the Xamarin team at Microsoft. He is a C# fanatic and has been writing softwares for web and desktop platforms for little over a decade. Since 2013, with Xamarin, he majorly focusses his time on writing iOS & Android Apps and evangelizing the joy of Mobile Dev. Working out of Bangalore, India, he's passionate about spreading C# and Xamarin love among .NET developers across the world. You will often find him speaking at Xamarin Evolve, Microsoft Conferences (/Build, TechEd, FutureUnleashed, etc.), and other conferences across APAC. Find him on Twitter & GitHub @nishanil",
    "image": "http://www.developermarch.com/mds/.img/speaker/nish-anil.png",
    "title": "Senior Program Manager",
    "company": "Xamarin",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/nish-anil.png",
    "webiste": "http://xamarin.com",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Laura Savino",
    "description": "Laura is an iOS developer with a penchant for languages, travel, and education. She's worked on all sorts of client apps through mobile agencies, and most recently built apps to transform students' learning at Khan Academy. Twitter: @Savinola",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_LauraSavino.png",
    "title": "iOS Developer",
    "company": "Khan Academy",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_LauraSavino.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Vidyasagar Machupalli",
    "description": "Vidyasagar Machupalli (VMac) is a Polyglot and Pragmatic programmer, who loves technologies changing lives. He is a well-known blogger and speaker in various technical communities. He currently works for IBM as a Developer Advocate promoting the use of IBM Cloud (Bluemix) through talks, articles, blogging, user demonstrations, recorded demonstrations, and by creating sample projects. Vidyasagar is a Microsoft MVP, Intel Software Innovator and DZone MVB. He is passionate about game development and spends his free time developing games and mobile apps.",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_VidyasagarMachupalli.png",
    "title": "Gamer",
    "company": "IBM",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_VidyasagarMachupalli.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Ajay Chebbi",
    "description": "Ajay is a Senior Architect in the Cloud Division at IBM Software Labs in India where he leads the development of IBM MobileFirst Platform Foundation on IBM Bluemix. He and his team are responsible for Mobile Foundation service on Bluemix and the Windows and Xamarin Mobile development platforms. He is working on bringing cloud deployment patterns to the MobileFirst platform. He has more than 23 years of experience in Software development. He has 4 patents filed in the USPTO. Ajay is very passionate about bringing joy to developers who use the products he builds! He spends his spare time blogging, creating samples, talking at meetups and conferences and other developer forums.",
    "image": "http://developermarch.com/mds/.img/speaker/ImageBox_MODS_AjayChebbi.png",
    "title": "Senior Architect",
    "company": "IBM",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://developermarch.com/mds/.img/speaker/ImageBox_MODS_AjayChebbi.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Adrian Kosmaczewski",
    "description": "Adrian Kosmaczewski is a writer, a software developer and a teacher. He is the author of two books about mobile software development, and has shipped mobile, web and desktop apps for iOS, Android, Mac OS X, Windows and Linux since 1996. Adrian holds a Master in Information Technology from the University of Liverpool.\n\nWhen not coding or teaching, Adrian likes to spend time with his wife Claudia, his cat Max and his Olivetti Lettera 22 typewriter.",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_Adrian-Kosmaczewski.png",
    "title": "Software Developer & Teacher",
    "company": "Indie",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_Adrian-Kosmaczewski.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Swaminathan Vetri",
    "description": "Swaminathan is a senior engineer at Target Corporation and an India Microsoft MVP - Visual Studio and Development technologies. He has experience on developing hybrid mobile applications using Apache Cordova, Angular.js, Ionic and Bootstrap. At work, his primary focus is on designing and developing applications using Microsoft technologies. Swaminathan is an avid blogger and speaks at user group meetings.",
    "image": "http://developermarch.com/mds/.img/speaker/ImageBox_MODS_SwaminathanVetri.png",
    "title": "Senior Engineer",
    "company": "Target",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://developermarch.com/mds/.img/speaker/ImageBox_MODS_SwaminathanVetri.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Rajesh Jeyapaul",
    "description": "Rajesh K Jeyapaul is a Cloud Solution Architect in the IBM EcoSystem & Developer team. He is focussed on enabling partners and developers on IBM cloud solution especially on Bluemix , IoT, Mobility and Big Data. He is also actively engaged in mentoring the vibrant startup community. He has been with IBM for 16+ years and having the industry experience for around 18 years. He started his carrier on Avionics real time simulation as a Research Fellow in India's Defense organization. At IBM , he has worked on various technologies involving: Java virtual machine, Operating System, Server virtualization, Cloud Management etc. He is an IBM Plateau holder with 4 patents and 3 publication. He has co-authored various technical books and is a IBM RedBooks author.",
    "image": "http://developermarch.com/mds/.img/speaker/Rajesh-Jeyapaul.png",
    "title": "Cloud Solution Architect",
    "company": "IBM",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://developermarch.com/mds/.img/speaker/Rajesh-Jeyapaul.png",
    "webiste": "",
    "titile": "",
    "biography": "Lori Lalonde is an author, consultant, blogger, conference speaker, Microsoft MVP, Xamarin MVP & Certified Mobile Developer. She is a proud member of the Western Devs group, and serves as the User Group Leader of CTTDNUG, a .NET User Group in Kitchener, Ontario. You can follow her on Twitter @loriblalonde, check out her blog at solola.ca, and see what she's been up to with the other Western Devs at westerndevs.com."
  },
  {
    "name": "Joe Keeley",
    "description": "Joe Keeley is a Partner and Lead Engineer at MartianCraft. He crafts technical solutions and solves business problems - from enterprise software systems at companies including Apple, AMD, Vistar, Intelligent Electronics, and Ahold USA / Stop and Shop / MAC Risk Management; to iOS solutions for venture-funded startups and Fortune 100 companies.\n\nHe is the co-author of the books \"Mastering iOS Frameworks\" and \"iOS Components and Frameworks, Understanding the Advanced Features of iOS\" from Addison-Wesley. Joe organizes the Denver Cocoaheads group, and frequently presents development topics at conferences and developer meetings. He is the author of two instructional iOS development videos produced by Addison-Wesley Professional.",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_JoeKeeley.png",
    "title": "Engineer",
    "company": "Slack",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_JoeKeeley.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Chethan Settipalli",
    "description": "Chethan is a passionate mobile and cloud developer, who takes pride in building innovative apps. He currently works for IBM as a lead developer for IBM MobileFirst Platform and Cloud Services. He is credited for some of most loved features in IBM MobileFirst Platform. He is adept at building apps for all major mobile platforms. He is well-known in IBM for his off-beat and innovative solutions for everyday problems.",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_ChethanSettipalli.png",
    "title": "Cloud Developer",
    "company": "IBM",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_ChethanSettipalli.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  },
  {
    "name": "Joshua Smith",
    "description": "Joshua Smith is a writer, pretend cartographer, and developer with AllTrails. He has 17 years of professional IT experience and has been a sysadmin (and still kinda is), programmer in various languages, consultant, employee and guy who makes sure the pop machine is full. He lives, works, and occasionally builds robots in Pittsburgh, PA.",
    "image": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_JoshuaSmith.png",
    "title": "Writer",
    "company": "Indie",
    "website": "N/A",
    "blog": "N/A",
    "twitter": "N/A",
    "email": "N/A",
    "avatar": "http://www.developermarch.com/mds/.img/speaker/ImageBox_MODS_JoshuaSmith.png",
    "webiste": "",
    "titile": "",
    "biography": ""
  }
]